# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.22-s017_1 on Thu Nov 15 10:54:58 CET 2018

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design raifes_dtm

create_clock -name "SYSCLK" -period 66.0 -waveform {0.0 33.0} [get_ports tck]
set_load -pin_load 1.1 [get_ports tdo]
set_load -pin_load 1.1 [get_ports {dmi_addr[6]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[5]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[4]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[3]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[2]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[1]}]
set_load -pin_load 1.1 [get_ports {dmi_addr[0]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[31]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[30]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[29]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[28]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[27]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[26]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[25]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[24]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[23]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[22]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[21]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[20]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[19]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[18]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[17]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[16]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[15]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[14]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[13]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[12]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[11]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[10]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[9]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[8]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[7]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[6]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[5]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[4]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[3]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[2]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[1]}]
set_load -pin_load 1.1 [get_ports {dmi_wdata[0]}]
set_load -pin_load 1.1 [get_ports dmi_en]
set_load -pin_load 1.1 [get_ports dmi_wen]
set_load -pin_load 1.1 [get_ports {adc_ctrl[15]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[14]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[13]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[12]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[11]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[10]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[9]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[8]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[7]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[6]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[5]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[4]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[3]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[2]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[1]}]
set_load -pin_load 1.1 [get_ports {adc_ctrl[0]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[31]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[30]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[29]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[28]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[27]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[26]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[25]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[24]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[23]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[22]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[21]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[20]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[19]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[18]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[17]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[16]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[15]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[14]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[13]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[12]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[11]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[10]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[9]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[8]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[7]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[6]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[5]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[4]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[3]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[2]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[1]}]
set_load -pin_load 1.1 [get_ports {puf_ctrl[0]}]
set_load -pin_load 1.1 [get_ports {debug_state[3]}]
set_load -pin_load 1.1 [get_ports {debug_state[2]}]
set_load -pin_load 1.1 [get_ports {debug_state[1]}]
set_load -pin_load 1.1 [get_ports {debug_state[0]}]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports tdo]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports tdi]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports tms]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[31]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[30]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[29]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[28]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[27]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[26]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[25]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[24]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[23]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[22]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[21]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[20]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[19]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[18]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[17]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[16]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[15]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[14]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[13]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[12]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[11]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[10]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[9]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[8]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[7]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[0]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmi_error]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmi_dm_busy]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[0]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[13]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[0]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmi_wen]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmi_en]
set_max_transition 2.75 [current_design]
set_max_capacitance 2.5 [current_design]
set_driving_cell -lib_cell BF -library L035dc -pin "O" [get_ports tck]
set_input_transition 2.5 [get_ports tms]
set_input_transition 2.5 [get_ports tdi]
set_input_transition 2.5 [get_ports {dmi_rdata[31]}]
set_input_transition 2.5 [get_ports {dmi_rdata[30]}]
set_input_transition 2.5 [get_ports {dmi_rdata[29]}]
set_input_transition 2.5 [get_ports {dmi_rdata[28]}]
set_input_transition 2.5 [get_ports {dmi_rdata[27]}]
set_input_transition 2.5 [get_ports {dmi_rdata[26]}]
set_input_transition 2.5 [get_ports {dmi_rdata[25]}]
set_input_transition 2.5 [get_ports {dmi_rdata[24]}]
set_input_transition 2.5 [get_ports {dmi_rdata[23]}]
set_input_transition 2.5 [get_ports {dmi_rdata[22]}]
set_input_transition 2.5 [get_ports {dmi_rdata[21]}]
set_input_transition 2.5 [get_ports {dmi_rdata[20]}]
set_input_transition 2.5 [get_ports {dmi_rdata[19]}]
set_input_transition 2.5 [get_ports {dmi_rdata[18]}]
set_input_transition 2.5 [get_ports {dmi_rdata[17]}]
set_input_transition 2.5 [get_ports {dmi_rdata[16]}]
set_input_transition 2.5 [get_ports {dmi_rdata[15]}]
set_input_transition 2.5 [get_ports {dmi_rdata[14]}]
set_input_transition 2.5 [get_ports {dmi_rdata[13]}]
set_input_transition 2.5 [get_ports {dmi_rdata[12]}]
set_input_transition 2.5 [get_ports {dmi_rdata[11]}]
set_input_transition 2.5 [get_ports {dmi_rdata[10]}]
set_input_transition 2.5 [get_ports {dmi_rdata[9]}]
set_input_transition 2.5 [get_ports {dmi_rdata[8]}]
set_input_transition 2.5 [get_ports {dmi_rdata[7]}]
set_input_transition 2.5 [get_ports {dmi_rdata[6]}]
set_input_transition 2.5 [get_ports {dmi_rdata[5]}]
set_input_transition 2.5 [get_ports {dmi_rdata[4]}]
set_input_transition 2.5 [get_ports {dmi_rdata[3]}]
set_input_transition 2.5 [get_ports {dmi_rdata[2]}]
set_input_transition 2.5 [get_ports {dmi_rdata[1]}]
set_input_transition 2.5 [get_ports {dmi_rdata[0]}]
set_input_transition 2.5 [get_ports dmi_error]
set_input_transition 2.5 [get_ports dmi_dm_busy]
set_input_transition 2.5 [get_ports {adc_data[15]}]
set_input_transition 2.5 [get_ports {adc_data[14]}]
set_input_transition 2.5 [get_ports {adc_data[13]}]
set_input_transition 2.5 [get_ports {adc_data[12]}]
set_input_transition 2.5 [get_ports {adc_data[11]}]
set_input_transition 2.5 [get_ports {adc_data[10]}]
set_input_transition 2.5 [get_ports {adc_data[9]}]
set_input_transition 2.5 [get_ports {adc_data[8]}]
set_input_transition 2.5 [get_ports {adc_data[7]}]
set_input_transition 2.5 [get_ports {adc_data[6]}]
set_input_transition 2.5 [get_ports {adc_data[5]}]
set_input_transition 2.5 [get_ports {adc_data[4]}]
set_input_transition 2.5 [get_ports {adc_data[3]}]
set_input_transition 2.5 [get_ports {adc_data[2]}]
set_input_transition 2.5 [get_ports {adc_data[1]}]
set_input_transition 2.5 [get_ports {adc_data[0]}]
set_dont_use [get_lib_cells L035dc/DEL20]
set_dont_use [get_lib_cells L035dc/DEL10]
set_dont_use [get_lib_cells L035dc/DEL3RC]
set_dont_use [get_lib_cells L035dc/DEL_10NS_RC]
set_dont_use [get_lib_cells L035dc/DEL_20NS_RC]
set_dont_use [get_lib_cells L035dc/DEL_30NS_RC]
set_dont_use [get_lib_cells L035dc/DEL_50NS_RC]
set_dont_use [get_lib_cells L035dc/SCHMTT]
set_dont_use [get_lib_cells L035dc/SCHMTTE]
set_dont_use [get_lib_cells L035dc/SCHMTT25]
set_dont_use [get_lib_cells L035dc/SCHMTT25E]
set_dont_use [get_lib_cells L035dc/SCHMTT50]
set_dont_use [get_lib_cells L035dc/SCHMTT50E]
set_dont_use [get_lib_cells L035dc/TLATX3]
set_clock_uncertainty -setup 5.0 [get_clocks SYSCLK]
set_clock_uncertainty -hold 1.0 [get_clocks SYSCLK]
