#-----------------------------------------------------------------------------------------------------------
#-------------------------------------- CLK Settings in pico seconds ----------------------------------------
#-----------------------------------------------------------------------------------------------------------
set CLK_SYSTEM clk
#set CLK_TST_INTERFACE clk
set CLK_SPEED_MHz 15.0

set MAX_TRANSITIONS 2.75
set INPUT_TRANSITIONS 2.5
set CLK_TRANSITIONS 2.5
set MAX_NET_CAP_LOAD 2.5
set CLK_SETUP_UNCERT 5
set CLK_HOLD_UNCERT 1

set OUTPUT_PORT_LOAD 1.1

#-----------------------------------------------------------------------------------------------------------
#-------------------------------------------- Timing Constraints -------------------------------------------
#-----------------------------------------------------------------------------------------------------------
set PERIOD_IN_ns [expr "int(1 / ($CLK_SPEED_MHz) * 1000)"]

set_units -capacitance pF -time ns

create_clock -period $PERIOD_IN_ns -domain SYSTEM -name SYSCLK [get_ports $CLK_SYSTEM]
#create_clock -period 66 -domain TSTCTRL -name TSTCLK [get_ports $CLK_TST_INTERFACE]

#create_generated_clock -name INT_CLK_6M78 -edges {1 3 5}		-source [get_ports clk_13m56_i]   [get_pins I_LOGIC/I_CLK_RES/CLK6M78]
#create_generated_clock -name INT_CLK_3M39 -edges {1 3 9}    	-source [get_ports clk_13m56_i]   [get_pins I_LOGIC/I_CLK_RES/CLK3M39] 
#create_generated_clock -name INT_CLK_1M695 -edges {1 3 17}    -source [get_ports clk_13m56_i]   [get_pins I_LOGIC/I_CLK_RES/CLK1M695] 

set_load $OUTPUT_PORT_LOAD -pin_load [all_outputs]
set_driving_cell -lib_cell BF [all_inputs]
set_max_transition $MAX_TRANSITIONS [current_design]
#set_clock_transition $CLK_TRANSITIONS SYSCLK
set_input_transition $INPUT_TRANSITIONS [all_inputs -no_clock]
set_max_capacitance $MAX_NET_CAP_LOAD [current_design]

set_clock_uncertainty -setup $CLK_SETUP_UNCERT SYSCLK
set_clock_uncertainty -hold $CLK_HOLD_UNCERT SYSCLK

set_clock_uncertainty -setup $CLK_SETUP_UNCERT TSTCLK
set_clock_uncertainty -hold $CLK_HOLD_UNCERT TSTCLK

#set_ideal_network [get_ports tif_reset_n_i]
set_ideal_network [get_ports reset]

#set_false_path -from TSTCLK -to SYSCLK
#set_false_path -from SYSCLK -to TSTCLK

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports sdo]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[13]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_haddr[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwrite}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hsize[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hsize[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hsize[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hburst[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hburst[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hburst[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hmastlock}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hprot[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hprot[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hprot[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hprot[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_trans[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_trans[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[13]]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hwdata[0]}]


set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[13]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_haddr[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwrite}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hsize[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hsize[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hsize[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hburst[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hburst[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hburst[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hmastlock}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hprot[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hprot[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hprot[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hprot[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_htrans[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_htrans[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[13]]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hwdata[0]}]


set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[31]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[30]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[29]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[28]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[27]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[26]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[25]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[24]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[23]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[22]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[21]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[20]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[19]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[18]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[17]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[16]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[15]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[14]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[13]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[12]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[11]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[10]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[9]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[8]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[7]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[6]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[5]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[4]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_rdata[0]}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_error}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_dm_busy}]

set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dm_state[3]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dm_state[2]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dm_state[1]}]
set_output_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dm_state[0]}]


set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports sdi]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports sen]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[23]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[22]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[21]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[20]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[19]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[18]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[17]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[16]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[15]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[14]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[13]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[12]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[11]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[10]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[9]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[8]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[7]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {ext_interrupts[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[31]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[30]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[29]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[28]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[27]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[26]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[25]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[24]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[23]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[22]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[21]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[20]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[19]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[18]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[17]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[16]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[15]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[14]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[13]]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[12]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[11]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[10]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[9]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[8]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[7]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hrdata[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports imem_hready]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {imem_hresp[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[31]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[30]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[29]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[28]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[27]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[26]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[25]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[24]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[23]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[22]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[21]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[20]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[19]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[18]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[17]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[16]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[15]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[14]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[13]]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[12]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[11]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[10]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[9]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[8]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[7]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hrdata[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmem_hready]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmem_hresp[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_addr[0]}]


set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[31]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[30]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[29]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[28]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[27]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[26]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[25]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[24]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[23]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[22]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[21]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[20]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[19]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[18]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[17]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[16]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[15]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[14]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[13]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[12]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[11]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[10]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[9]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[8]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[7]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[6]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[5]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[4]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[3]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[2]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[1]}]
set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports {dmi_wdata[0]}]

set_input_delay -clock [get_clocks SYSCLK] -add_delay -max 10.0 [get_ports dmi_wen]
